Documents/РешениеОПриемеНаРаботу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>РешениеОПриемеНаРаботу</Name>
			<BasedOn>
				<xr:Item>Catalog.Кандидаты</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ПланОбученияСотрудников</xr:Item>
				<xr:Item>InformationRegister.ОбновлениеЗаданийАдаптацииУвольнения</xr:Item>
				<xr:Item>InformationRegister.МероприятияАдаптацииУвольненияПоДокументу</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кандидат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кандидаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьПоШтатномуРасписанию</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШтатноеРасписание</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоваяПозиция</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрофильДолжности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрофилиДолжностей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПриема</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапланироватьПрограммуОбучения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспытательныйСрок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СогласованныйДоход</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДистанционнаяРабота</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочееМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеМестаОхраныТруда</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантОплатыТруда</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыОплатыТруда</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Территория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТерриторииВыполненияРабот</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛичныеДанныеКандидата</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛичныеДанныеКандидатов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>МероприятияАдаптацииУвольнения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Мероприятие</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МероприятияАдаптацииУвольнения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Исполнитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РолиИсполнителей</v8:Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Comment>Плановый срок исполнения задачи</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПрограммаОбучения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Мероприятие</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МероприятияОбученияРазвития</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ответственный</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУчебныхЧасов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>8</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаРасходов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ВариантыОплатыТруда.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВариантыОплатыТруда</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ФОТ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СогласованныйДоход</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СостоянияСогласования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СостоянияСогласования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Отклонено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Рассматривается</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласовано</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/РешениеОПриемеНаРаботу/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление(УсловноеОформление);
	
	Если ЗначениеЗаполнено(Объект.Кандидат) Тогда
		ФизическоеЛицо = НайтиФизическоеЛицо(Объект.Ссылка, Объект.Кандидат);
	КонецЕсли;
		
	Если Параметры.Ключ.Пустая() Тогда
		ЗначенияДляЗаполнения = Новый Структура("Организация, Ответственный, ДатаСобытия", 
			"Объект.Организация", "Объект.Ответственный", "Объект.ДатаПриема");
		ЗарплатаКадры.ЗаполнитьПервоначальныеЗначенияВФорме(ЭтотОбъект, ЗначенияДляЗаполнения);
		Если ЗначениеЗаполнено(Объект.ДолжностьПоШтатномуРасписанию) Тогда
			ЗаполнитьМероприятияНаСервере();
		КонецЕсли;
		ПриПолученииДанных();
	КонецЕсли;
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ДляРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ДляРазмещения.КоманднаяПанель = Элементы.КомандыФормыПанель;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ДляРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначения.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплата");
		МодульПроцессыОбработкиДокументовЗарплата.ПриСозданииНаСервере(ЭтотОбъект, Объект);
	КонецЕсли;
	// Конец ПроцессыОбработкиДокументов
	
	// ИнтеграцияС1СДокументооборотом
	Если ОбщегоНазначения.ПодсистемаСуществует("ИнтеграцияС1СДокументооборотом") Тогда
		МодульИнтеграцияС1СДокументооборотБазоваяФункциональность = ОбщегоНазначения.ОбщийМодуль(
			"ИнтеграцияС1СДокументооборотБазоваяФункциональность");
		МодульИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	КонецЕсли;
	// Конец ИнтеграцияС1СДокументооборотом
	
	// СтандартныеПодсистемы.РаботаСФайлами
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаСФайлами") Тогда
		МодульРаботаСФайлами = ОбщегоНазначения.ОбщийМодуль("РаботаСФайлами");
		ГиперссылкаФайлов = МодульРаботаСФайлами.ГиперссылкаФайлов();
		ГиперссылкаФайлов.Размещение = Элементы.КомандыФормыПанель.Имя;
		МодульРаботаСФайлами.ПриСозданииНаСервере(ЭтотОбъект, ГиперссылкаФайлов);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.РаботаСФайлами
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.РаботаСФайлами
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаСФайлами") Тогда
		МодульРаботаСФайламиКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("РаботаСФайламиКлиент");
		МодульРаботаСФайламиКлиент.ПриОткрытии(ЭтотОбъект, Отказ);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.РаботаСФайлами
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.Свойства 
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.РаботаСФайлами
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаСФайлами") Тогда
		МодульРаботаСФайламиКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("РаботаСФайламиКлиент");
		МодульРаботаСФайламиКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.РаботаСФайлами
	
	Если ИмяСобытия = "Запись_ПриемНаРаботу" Тогда
		ОбновитьДанныеФормы();
	КонецЕсли;
	
	ОбработатьОповещениеРабочегоМеста(ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	ПриПолученииДанных(ТекущийОбъект);
	
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначения.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплата");
		МодульПроцессыОбработкиДокументовЗарплата.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец ПроцессыОбработкиДокументов
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)

	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Если СвойствоСтруктуры(ПараметрыЗаписи, "ИскатьПринятогоСотрудника", Истина) 
			И Не ЕстьСвязанныйСРешениемСотрудник() Тогда
			Отказ = Истина;
			НачатьПоискСотрудника(ПараметрыЗаписи);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ОповеститьКандидата = ПрочитанныйКандидат;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначения.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплата");
		МодульПроцессыОбработкиДокументовЗарплата.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи, Отказ);
	КонецЕсли;		
	// Конец ПроцессыОбработкиДокументов
	
	// ИнтеграцияС1СДокументооборотом
	Если ОбщегоНазначения.ПодсистемаСуществует("ИнтеграцияС1СДокументооборотом") Тогда
		МодульИнтеграцияС1СДокументооборотБазоваяФункциональность = ОбщегоНазначения.ОбщийМодуль(
			"ИнтеграцияС1СДокументооборотБазоваяФункциональность");
		МодульИнтеграцияС1СДокументооборотБазоваяФункциональность.ПередЗаписьюНаСервере(
			ЭтотОбъект,
			ТекущийОбъект,
			ПараметрыЗаписи);
	КонецЕсли;
	// Конец ИнтеграцияС1СДокументооборотом
	
	Если ПараметрыЗаписи.Свойство("ГруппаДоступаФизическогоЛица") Тогда
		ТекущийОбъект.ДополнительныеСвойства.Вставить("ГруппаДоступа",
			ПараметрыЗаписи.ГруппаДоступаФизическогоЛица);
	КонецЕсли;
	
	Если ПараметрыЗаписи.Свойство("СведенияОСотруднике") Тогда
		ТекущийОбъект.ДополнительныеСвойства.Вставить("СведенияОСотруднике", ПараметрыЗаписи.СведенияОСотруднике);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	АдаптацияУвольнениеФормы.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	СинхронизацияДанныхЗарплатаКадры.ЗапуститьОтложеннуюОбработкуЗаполненияДанныхПоФизическимЛицам(ТекущийОбъект);
	
	ПриПолученииДанных(ТекущийОбъект);
	
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначения.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплата");
		МодульПроцессыОбработкиДокументовЗарплата.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	КонецЕсли;	
	// Конец ПроцессыОбработкиДокументов
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначенияКлиент.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплатаКлиент");
		МодульПроцессыОбработкиДокументовЗарплата.ПередЗакрытием(ЭтотОбъект, Объект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	КонецЕсли;	
	// Конец ПроцессыОбработкиДокументов
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ПараметрыОповещения = Новый Структура();
	ПараметрыОповещения.Вставить("Кандидат", Объект.Кандидат);
	ОбщегоНазначенияКлиент.ОповеститьОбИзмененииОбъекта(Объект.Ссылка, ПараметрыОповещения);
	Если ЗначениеЗаполнено(ОповеститьКандидата) И ОповеститьКандидата <> Объект.Кандидат Тогда
		ПараметрыОповещения.Кандидат = ОповеститьКандидата;
		ОбщегоНазначенияКлиент.ОповеститьОбИзмененииОбъекта(Объект.Ссылка, ПараметрыОповещения);
	КонецЕсли;
	
	Пока ПослеЗаписи.Количество() > 0 Цикл
		ИмяОбработчика = ПослеЗаписи.Получить(0).Значение;
		ПослеЗаписи.Удалить(0);
		ВыполнитьОбработкуОповещения(Новый ОписаниеОповещения(ИмяОбработчика, ЭтотОбъект));
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	Объект.МероприятияАдаптацииУвольнения.Очистить();
	Объект.Подразделение = Неопределено;
	УстановитьВидимостьОплатыТруда();
	ЗаполнитьДанныеПоПозицииНаКлиенте();
	УстановитьФункциональныеОпцииФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура КандидатПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.Кандидат) Тогда
		ФизическоеЛицо = НайтиФизическоеЛицо(Объект.Ссылка, Объект.Кандидат);
		Объект.ЛичныеДанныеКандидата = ЛичныеДанныеКандидата(Объект.Кандидат);
	Иначе
		ФизическоеЛицо = ПредопределенноеЗначение("Справочник.ФизическиеЛица.ПустаяСсылка");
		Объект.ЛичныеДанныеКандидата = ПредопределенноеЗначение("Справочник.ЛичныеДанныеКандидатов.ПустаяСсылка");
	КонецЕсли;
	
	ЗаполнитьМероприятияНаКлиенте();
	ЗаполнитьДанныеПоКандидатуНаКлиенте();
	
	УстановитьПредупреждениеОДругомРешении(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура КандидатНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыОткрытияФормы = Новый Структура;
	ПараметрыОткрытияФормы.Вставить("ТекущийДокумент", Объект.Ссылка);
	ПараметрыОткрытияФормы.Вставить("Организация", Объект.Организация);
	
	ОткрытьФорму("Документ.РешениеОПриемеНаРаботу.Форма.ФормаВыбораКандидата", ПараметрыОткрытияФормы, Элемент, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриемаПриИзменении(Элемент)
	
	НачатьПерезаполнениеМероприятий();
	
КонецПроцедуры

&НаКлиенте
Процедура ДолжностьПоШтатномуРасписаниюПриИзменении(Элемент)
	
	ЗаполнитьМероприятияНаКлиенте();
	ЗаполнитьДанныеПоПозицииНаКлиенте();
	УстановитьВидимостьОплатыТруда();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапланироватьПрограммуОбученияПриИзменении(Элемент)
	УстановитьДоступностьПрограммаОбучения(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура НоваяПозицияПриИзменении(Элемент)
	
	УстановитьВидимостьДолжности(ЭтаФорма);
	УстановитьВидимостьРабочегоМеста();
	УстановитьВидимостьОплатыТруда();
	ЗаполнитьМероприятияНаКлиенте();
	ЗаполнитьДанныеПоПозицииНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура ДолжностьПриИзменении(Элемент)
	ЗаполнитьМероприятияНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	ЗаполнитьМероприятияНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ПрофильДолжностиПриИзменении(Элемент)
	ЗаполнитьИспытательныйСрокНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ИспытательныйСрокПриИзменении(Элемент)
	УстановитьСклонениеИспытательногоСрока(Объект.ИспытательныйСрок, Элементы.ИспытательныйСрок);
	УстановитьВидимостьПредупреждения(Объект.ИспытательныйСрок, Элементы.ИспытательныйСрокПредупреждение);
КонецПроцедуры

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
		
	СтандартнаяОбработка = Ложь;
	
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(
		Элемент.ТекстРедактирования,
		ЭтотОбъект,
		"Объект.Комментарий");
	
КонецПроцедуры

// СтандартныеПодсистемы.РаботаСФайлами
&НаКлиенте
Процедура Подключаемый_ПолеПредпросмотраНажатие(Элемент, СтандартнаяОбработка)
	
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаСФайлами") Тогда
		МодульРаботаСФайламиКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("РаботаСФайламиКлиент");
		МодульРаботаСФайламиКлиент.ПолеПредпросмотраНажатие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПолеПредпросмотраПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаСФайлами") Тогда
		МодульРаботаСФайламиКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("РаботаСФайламиКлиент");
		МодульРаботаСФайламиКлиент.ПолеПредпросмотраПроверкаПеретаскивания(ЭтотОбъект, Элемент,
			ПараметрыПеретаскивания, СтандартнаяОбработка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПолеПредпросмотраПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаСФайлами") Тогда
		МодульРаботаСФайламиКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("РаботаСФайламиКлиент");
		МодульРаботаСФайламиКлиент.ПолеПредпросмотраПеретаскивание(ЭтотОбъект, Элемент,
			ПараметрыПеретаскивания, СтандартнаяОбработка);
	КонецЕсли;
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.РаботаСФайлами

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыНазначаемыеМероприятия

&НаКлиенте
Процедура НазначаемыеМероприятияМероприятиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	АдаптацияУвольнениеКлиент.НазначаемыеМероприятияМероприятиеНачалоВыбора(ЭтотОбъект, Элемент, СтандартнаяОбработка, Истина);
КонецПроцедуры

&НаКлиенте
Процедура НазначаемыеМероприятияМероприятиеОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура НазначаемыеМероприятияМероприятиеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ДопПараметры = ПараметрыПолученияСвойствНазначаемогоМероприятия();
	АдаптацияУвольнениеКлиент.НазначаемыеМероприятияМероприятиеОбработкаВыбора(ЭтотОбъект, Элемент, ВыбранноеЗначение, ДопПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура НазначаемыеМероприятияПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.НазначаемыеМероприятия.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.Мероприятие) И Не Объект.Ссылка.Пустая() Тогда
		ЗаполнитьЗначенияСвойств(ТекущиеДанные, РезультатыМероприятия(Объект.Ссылка, ТекущиеДанные.Мероприятие));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НазначаемыеМероприятияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Поле = Элементы.НазначаемыеМероприятияРезультатВыполнения
		И ЗначениеЗаполнено(ТекущиеДанные.ЗаданиеАдаптацииУвольнения) Тогда
		СтандартнаяОбработка = Ложь;
		ПоказатьЗначение(, ТекущиеДанные.ЗаданиеАдаптацииУвольнения);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПрограммаОбучения

&НаКлиенте
Процедура ПрограммаОбученияМероприятиеПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ПрограммаОбучения.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗависимыеОтМероприятияОбученияРеквизиты(ТекущиеДанные.ПолучитьИдентификатор());
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

// СтандартныеПодсистемы.РаботаСФайлами
&НаКлиенте
Процедура Подключаемый_КомандаПанелиПрисоединенныхФайлов(Команда)
	
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаСФайлами") Тогда
		МодульРаботаСФайламиКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("РаботаСФайламиКлиент");
		МодульРаботаСФайламиКлиент.КомандаУправленияПрисоединеннымиФайлами(ЭтотОбъект, Команда);
	КонецЕсли;
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.РаботаСФайлами

#Область ОбработчикиСобытийПроцессыОбработкиДокументов

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокумента(Команда)
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначенияКлиент.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплатаКлиент");
		МодульПроцессыОбработкиДокументовЗарплата.ВыполнитьЗадачу(ЭтотОбъект, Команда, Объект)
	КонецЕсли;		
	// Конец ПроцессыОбработкиДокументов
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокументаОповещение(Контекст, ДополнительныеПараметры) Экспорт
	ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст);
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры, Контекст);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст)
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда	
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначения.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплата");
		МодульПроцессыОбработкиДокументовЗарплата.ВыполнитьЗадачу(ЭтотОбъект, Контекст, Объект);
	КонецЕсли;		
	// Конец ПроцессыОбработкиДокументов
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийНаправившегоОткрытие(Элемент, СтандартнаяОбработка)
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда	
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначенияКлиент.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплатаКлиент");
		МодульПроцессыОбработкиДокументовЗарплата.КомментарийНаправившегоОткрытие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	КонецЕсли;		
	// Конец ПроцессыОбработкиДокументов
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийСледующемуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда	
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначенияКлиент.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплатаКлиент");
		МодульПроцессыОбработкиДокументовЗарплата.КомментарийСледующемуНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);
	КонецЕсли;		
	// Конец ПроцессыОбработкиДокументов
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ЗаполнитьМероприятия(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ЗаполнитьМероприятияПослеПроверкиСпискаМероприятий", ЭтотОбъект);
	ЗарплатаКадрыРасширенныйКлиент.ПроверитьВозможностьОчисткиТабличныхЧастей(ЭтотОбъект, "МероприятияАдаптацииУвольнения", Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПринятьНаРаботу(Команда)
	НачатьПриемНаРаботу();
КонецПроцедуры

&НаКлиенте
Процедура НаправитьНаМедосмотр(Команда)
	
	ДополнительныеПараметры = Новый Структура("Записан", Истина);
	
	Если Параметры.Ключ.Пустая() Тогда
		ДополнительныеПараметры.Записан = Ложь;
		Оповещение = Новый ОписаниеОповещения("НаправитьНаМедосмотрЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		ТекстВопроса = НСтр("ru = 'Документ будет записан. Продолжить?'");
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе
		НаправитьНаМедосмотрЗавершение(КодВозвратаДиалога.Да, ДополнительныеПараметры);
	КонецЕсли;
	
КонецПроцедуры

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ИнтеграцияС1СДокументооборотом") Тогда
		МодульИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль(
			"ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент");
		МодульИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(
			Команда,
			ЭтотОбъект,
			Объект);
	КонецЕсли;
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

&НаКлиенте
Процедура Провести(Команда)
	Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
КонецПроцедуры

&НаКлиенте
Процедура ПровестиЗакрыть(Команда)
	ПослеЗаписи.Добавить("ЗакрытьФормуПослеЗаписи");
	Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПриПолученииДанных(ТекущийОбъект = Неопределено)
	
	Если ТекущийОбъект = Неопределено Тогда
		ТекущийОбъект = Объект;
	КонецЕсли;
	
	ОбновитьДанныеФормы();
	
	ПрочитанныйКандидат = ТекущийОбъект.Кандидат;
	УстановитьПредупреждениеОДругомРешении(ЭтотОбъект);
	
КонецПроцедуры

// СтандартныеПодсистемы.Свойства 
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

&НаСервере
Процедура УстановитьДоступностьЭлементов()
	
	ПриказОформлен = ЗначениеЗаполнено(КадровыйПриказИнфоНадпись);
	Элементы.ПринятьНаРаботу.Доступность = (Не ПриказОформлен И ПравоДоступа("Добавление",
		Метаданные.Документы.ПриемНаРаботу));
	
	Если ПриказОформлен Тогда
		Элементы.ОсновноеГруппа.Доступность = Ложь;
		Элементы.СтандартныеГруппа.Доступность = Ложь;
		Элементы.ДатаПриема.Доступность = Ложь;
		Элементы.ГлавноеГруппа.Доступность = Ложь;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ПрофильДолжности", "Видимость",
		ПравоДоступа("Чтение", Метаданные.Справочники.ПрофилиДолжностей));
	
	УстановитьВидимостьЗадачАдаптации();

	УстановитьОтображениеЗакладокФормы();
	
	УстановитьДоступностьПрограммаОбучения(ЭтотОбъект);
	
	УстановитьВидимостьКандидата(ЭтотОбъект);
	УстановитьВидимостьДолжности(ЭтотОбъект);
	УстановитьВидимостьОплатыТруда();
	УстановитьВидимостьРабочегоМеста();
	УстановитьСклонениеИспытательногоСрока(Объект.ИспытательныйСрок, Элементы.ИспытательныйСрок);
	УстановитьВидимостьПредупреждения(Объект.ИспытательныйСрок, Элементы.ИспытательныйСрокПредупреждение);
	УстановитьФункциональныеОпцииФормы();
	
	УстановитьДоступностьРабочегоМеста(ЭтаФорма);
	ДанныеПозиции = ДанныеПозицииШтатногоРасписания(Объект.ДолжностьПоШтатномуРасписанию);
	СписокРабочихМест = СписокРабочихМестПоДаннымПозиции(ДанныеПозиции);
	Элементы.РабочееМесто.СписокВыбора.ЗагрузитьЗначения(СписокРабочихМест.ВыгрузитьЗначения());
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьПерезаполнениеМероприятий()
	
	Если Объект.МероприятияАдаптацииУвольнения.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ЗаголовокВопроса = НСтр("ru = 'Задачи адаптации'");
	ТекстВопроса = НСтр("ru = 'Перезаполнить список мероприятий?'");
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершитьПерезаполнениеМероприятий", ЭтотОбъект);
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет,,, ЗаголовокВопроса);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьПерезаполнениеМероприятий(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьМероприятияНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьМероприятияНаКлиенте()
	
	Объект.МероприятияАдаптацииУвольнения.Очистить();
	
	Если Не Объект.НоваяПозиция И Не ЗначениеЗаполнено(Объект.ДолжностьПоШтатномуРасписанию) Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.НоваяПозиция Тогда
		Если Не ЗначениеЗаполнено(Объект.Должность) И Не ЗначениеЗаполнено(Объект.Подразделение) Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;

	ЗаполнитьМероприятияНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьМероприятияПослеПроверкиСпискаМероприятий(Отказ, ДополнительныеПараметры = Неопределено) Экспорт 
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьМероприятияНаКлиенте();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьМероприятияНаСервере()
	
	Если Не ЗначениеЗаполнено(ФизическоеЛицо) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыЗаполнения = Документы.РешениеОПриемеНаРаботу.ПараметрыЗаполненияМероприятий(Объект, ФизическоеЛицо);
	АдаптацияУвольнениеФормы.ЗаполнитьНазначаемыеМероприятия(ЭтотОбъект, ПараметрыЗаполнения);
	
	ОбучениеРазвитиеФормы.ЗаполнитьПрограммуОбученияИзПозицииШР(Объект.ПрограммаОбучения,
		Объект.ДолжностьПоШтатномуРасписанию, Объект.ДатаПриема);
	
	Объект.ЗапланироватьПрограммуОбучения = Объект.ПрограммаОбучения.Количество() > 0;  
	УстановитьДоступностьПрограммаОбучения(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Функция ПараметрыПолученияСвойствНазначаемогоМероприятия()
	
	ПараметрыПолучения = АдаптацияУвольнениеКлиент.ПараметрыПолученияСвойствНазначаемогоМероприятия();
	ПараметрыПолучения.ФизическоеЛицо = ФизическоеЛицо;
	ПараметрыПолучения.ДатаСобытия = Объект.ДатаПриема;
	ПараметрыПолучения.Подразделение = Объект.Подразделение;
	ПараметрыПолучения.Позиция = Объект.ДолжностьПоШтатномуРасписанию;
	
	Возврат ПараметрыПолучения;
	
КонецФункции

&НаСервереБезКонтекста
Функция НайтиСотрудникаПоКандидату(Кандидат)
	
	Сведения = КадровыеРешенияКлиентСервер.СведенияОСотруднике();
	Сведения.Сотрудник = ПодборПерсонала.СотрудникКандидата(Кандидат);
	Сведения.ПриказОПриеме = ПриказОПриемеСотрудника(Сведения.Сотрудник);
	Возврат Сведения;
	
КонецФункции

&НаСервереБезКонтекста
Функция СведенияОСотрудникеСвязанномСРешением(Решение)
	
	Сведения = КадровыеРешенияКлиентСервер.СведенияОСотруднике();
	Сведения.Сотрудник = Документы.РешениеОПриемеНаРаботу.СотрудникПоРешениюОПриемеНаРаботу(Решение);
	Сведения.ПриказОПриеме = ПриказОПриемеСотрудника(Сведения.Сотрудник);
	Возврат Сведения;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПриказОПриемеСотрудника(Сотрудник)

	Если Сотрудник = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	ТаблицаПоРабочимМестам = КадровыйУчет.КадровыеДанныеСотрудников(Ложь, Сотрудник, "ПриказОПриеме");
	УстановитьПривилегированныйРежим(Ложь);
	
	Если ТаблицаПоРабочимМестам.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;

	Возврат ?(ЗначениеЗаполнено(ТаблицаПоРабочимМестам[0].ПриказОПриеме), 
		ТаблицаПоРабочимМестам[0].ПриказОПриеме, Неопределено);
	
КонецФункции

&НаКлиенте
Процедура НачатьПриемНаРаботу()

	Если Не ЗначениеЗаполнено(ФизическоеЛицо) Тогда
		ФизическоеЛицо = НайтиФизическоеЛицо(Объект.Ссылка, Объект.Кандидат);
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.Проверить(ЗначениеЗаполнено(ФизическоеЛицо),
		НСтр("ru = 'Не найдено связанное с кандидатом физическое лицо. Прием на работу невозможен.'"));
	
	Если Не Параметры.Ключ.Пустая() И Объект.Проведен И Не Модифицированность Тогда
		ЗавершитьПриемНаРаботу();
		Возврат;
	КонецЕсли;

	ПоказатьВопрос(Новый ОписаниеОповещения("ПродолжитьПриемНаРаботу", ЭтотОбъект), 
		НСтр("ru = 'Перед приемом на работу документ требуется провести. Продолжить?'"), 
		РежимДиалогаВопрос.ДаНет, , , 
		НСтр("ru = 'Документ не проведен'"));
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьПриемНаРаботу(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;

	ПослеЗаписи.Добавить("ЗавершитьПриемНаРаботуПослеЗаписи");
	ПараметрыЗаписи = ПараметрыЗаписиДляПроведения();
	Записать(ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьПриемНаРаботуПослеЗаписи(Результат, ДополнительныеПараметры) Экспорт // АПК:78 используется как обработчик оповещения после записи
	ЗавершитьПриемНаРаботу();
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФормуПослеЗаписи(Результат, ДополнительныеПараметры) Экспорт // АПК:78 используется как обработчик оповещения после записи

	Если Открыта() Тогда
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПараметрыЗаписиДляПроведения()
	ПараметрыЗаписи = Новый Структура();
	ПараметрыЗаписи.Вставить("РежимЗаписи", РежимЗаписиДокумента.Проведение);
	ПараметрыЗаписи.Вставить("ИскатьПринятогоСотрудника", Истина);
	Возврат ПараметрыЗаписи;
КонецФункции

&НаКлиенте
Функция ЕстьСвязанныйСРешениемСотрудник()
	
	Если Объект.Кандидат <> ПрочитанныйКандидат Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Не Параметры.Ключ.Пустая() И СвязанныйСРешениемСотрудник(Объект.Ссылка) <> Неопределено;
	
КонецФункции

&НаСервереБезКонтекста
Функция СвязанныйСРешениемСотрудник(Решение)
	УстановитьПривилегированныйРежим(Истина);
	Возврат Документы.РешениеОПриемеНаРаботу.СотрудникПоРешениюОПриемеНаРаботу(Решение);
КонецФункции

&НаКлиенте
Процедура НачатьПоискСотрудника(ПараметрыЗаписи)
	
	Сведения = НайтиСотрудникаПоКандидату(Объект.Кандидат);
	
	ПараметрыЗаписи.Вставить("ИскатьПринятогоСотрудника", Ложь);

	Если Не ЗначениеЗаполнено(Сведения.Сотрудник) Тогда
		Записать(ПараметрыЗаписи);
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Сведения.ПриказОПриеме) Тогда
		ТекстВопроса = СтроковыеФункцииКлиент.ФорматированнаяСтрока(
			НСтр("ru = 'Найден(а) <a href=""%1"">%2</a>'"), 
			ПолучитьНавигационнуюСсылку(Сведения.Сотрудник),
			Строка(Сведения.Сотрудник));
	Иначе
		ТекстВопроса = СтроковыеФункцииКлиент.ФорматированнаяСтрока(
			НСтр("ru = 'Найден(а) <a href=""%1"">%2</a>, оформленный(ая) приказом <a href=""%3"">%4</a>'"), 
			ПолучитьНавигационнуюСсылку(Сведения.Сотрудник),
			Строка(Сведения.Сотрудник),
			ПолучитьНавигационнуюСсылку(Сведения.ПриказОПриеме),
			Строка(Сведения.ПриказОПриеме));
	КонецЕсли;
	
	КнопкиОтвета = Новый СписокЗначений;
	КнопкиОтвета.Добавить(КодВозвратаДиалога.Прервать, НСтр("ru = 'Связать найденного сотрудника с этим документом'"));
	КнопкиОтвета.Добавить(КодВозвратаДиалога.Повторить, НСтр("ru = 'Принять на работу еще одного сотрудника'"));
	КнопкиОтвета.Добавить(КодВозвратаДиалога.Отмена);
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("ПараметрыЗаписи", ПараметрыЗаписи);
	ДополнительныеПараметры.Вставить("СведенияОСотруднике", Сведения);
	
	ПоказатьВопрос(Новый ОписаниеОповещения("ПродолжитьПослеВопросаОНайденномСотруднике", ЭтотОбъект, ДополнительныеПараметры), 
		ТекстВопроса, КнопкиОтвета, , , НСтр("ru = 'Найден похожий сотрудник'"));
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьПослеВопросаОНайденномСотруднике(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = Неопределено Или Ответ = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыЗаписи = ДополнительныеПараметры.ПараметрыЗаписи;

	Если Ответ = КодВозвратаДиалога.Прервать Тогда
		// Пробросить в модуль объекта в проведение приказ и сотрудника, которых нужно привязать
		ПараметрыЗаписи.Вставить("СведенияОСотруднике", ДополнительныеПараметры.СведенияОСотруднике);
	ИначеЕсли Ответ = КодВозвратаДиалога.Повторить Тогда
		// Ничего не делаем, продолжаем запись-проведение, создастся новый сотрудник
	Иначе
		ОбщегоНазначенияКлиентСервер.Проверить(Ложь, 
			НСтр("ru = 'Неожиданный ответ на вопрос о создании приказа о приеме на работу'"),
			"Документы.РешениеОПриемеНаРаботу.Формы.ФормаДокумента");
	КонецЕсли;

	Записать(ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьПриемНаРаботу()
	
	СведенияОСотруднике = СведенияОСотрудникеСвязанномСРешением(Объект.Ссылка);
	ОбщегоНазначенияКлиентСервер.Проверить(ЗначениеЗаполнено(СведенияОСотруднике.Сотрудник), 
		НСтр("ru = 'Не обнаружен сотрудник, связанный с документом, для приема на работу.'"), 
		"Документы.РешениеОПриемеНаРаботу.Формы.ФормаДокумента");
	
	Если Не ЗначениеЗаполнено(СведенияОСотруднике.ПриказОПриеме) Тогда
		СоздатьПриказОПриеме();
		Возврат;
	КонецЕсли;

	ПриказПоЭтомуРешению = СвязанныйСРешениемПриказ(Объект.Ссылка);
	Если ПриказПоЭтомуРешению = СведенияОСотруднике.ПриказОПриеме Тогда
		// Нужный приказ уже привязан. 
		Возврат;
	КонецЕсли;
	
	ТекстВопроса = СтроковыеФункцииКлиент.ФорматированнаяСтрока(
		НСтр("ru = '<a href=""%1"">%2</a>, уже принят(а) на работу приказом <a href=""%3"">%4</a>.'"), 
		ПолучитьНавигационнуюСсылку(СведенияОСотруднике.Сотрудник),
		Строка(СведенияОСотруднике.Сотрудник),
		ПолучитьНавигационнуюСсылку(СведенияОСотруднике.ПриказОПриеме),
		Строка(СведенияОСотруднике.ПриказОПриеме));
	
	КнопкиОтвета = Новый СписокЗначений;
	КнопкиОтвета.Добавить(КодВозвратаДиалога.ОК, НСтр("ru = 'Связать приказ с этим решением'"));
	КнопкиОтвета.Добавить(КодВозвратаДиалога.Отмена);
	
	ПоказатьВопрос(Новый ОписаниеОповещения("ПродолжитьСозданиеПриемаНаРаботу", ЭтотОбъект, СведенияОСотруднике.ПриказОПриеме), 
		ТекстВопроса, КнопкиОтвета, , , НСтр("ru = 'Найден похожий сотрудник'"));
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьСозданиеПриемаНаРаботу(Ответ, ПриказОПриеме) Экспорт
	
	Если Ответ = Неопределено Или Ответ = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	Если Ответ = КодВозвратаДиалога.ОК Тогда
		СвязатьПриказСРешением(ПриказОПриеме);
	Иначе
		ОбщегоНазначенияКлиентСервер.Проверить(Ложь, 
			НСтр("ru = 'Неожиданный ответ на вопрос о создании приказа о приеме на работу'"),
			"Документы.РешениеОПриемеНаРаботу.Формы.ФормаДокумента");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПриказОПриеме()
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", РеквизитыНовогоПриказа(ФизическоеЛицо));
	ПараметрыФормы.Вставить("ПриемНаПозицию", Объект.ДолжностьПоШтатномуРасписанию);
	
	ОткрытьФорму("Документ.ПриемНаРаботу.Форма.ФормаДокумента", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Функция РеквизитыНовогоПриказа(ФизическоеЛицо)
	Возврат Документы.РешениеОПриемеНаРаботу.ДанныеЗаполненияПриемаНаРаботуПоДокументуРешения(
		РеквизитФормыВЗначение("Объект"), СотрудникДляПриемаНаРаботу(Объект.Ссылка), ФизическоеЛицо);
КонецФункции

&НаСервереБезКонтекста
Функция СотрудникДляПриемаНаРаботу(РешениеСсылка)
	Возврат Документы.РешениеОПриемеНаРаботу.СотрудникПоРешениюОПриемеНаРаботу(РешениеСсылка);
КонецФункции

// Связать приказ с решением.
// 
// Параметры:
//  ПриказОПриеме - ДокументСсылка.ПриемНаРаботу
&НаСервере
Процедура СвязатьПриказСРешением(ПриказОПриеме)
	
	ПриказОбъект = ПриказОПриеме.ПолучитьОбъект();
	
	ОбщегоНазначенияКлиентСервер.Проверить(Не ЗначениеЗаполнено(ПриказОбъект.Решение), 
		СтрШаблон(НСтр("ru = 'Приказ о приеме %1 уже связан с другим решением %2'"), ПриказОПриеме, ПриказОбъект.Решение), 
		Метаданные.Документы.РешениеОПриемеНаРаботу.Формы.ФормаДокумента.ПолноеИмя());
	
	ПриказОбъект.Решение = Объект.Ссылка;
	ПриказОбъект.Записать(РежимЗаписиДокумента.Запись);
	
	ОбновитьДанныеФормы();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СвязанныйСРешениемПриказ(Решение)
	Возврат КадровыеРешения.СвязанныйСРешениемПриказ(Решение);
КонецФункции

&НаСервере
Процедура УстановитьВидимостьЗадачАдаптации()
	Элементы.ЗадачиАдаптацииСтраница.Видимость = ПолучитьФункциональнуюОпцию("ИспользоватьАдаптациюУвольнение");
КонецПроцедуры

&НаСервере
Процедура УстановитьОтображениеЗакладокФормы()
	
	Если (Не Элементы.ЗадачиАдаптацииСтраница.Видимость 
		Или Элементы.ЗадачиАдаптацииСтраница.ПодчиненныеЭлементы.Количество() = 0)
		И Элементы.ПрограммаОбученияСтраница.ПодчиненныеЭлементы.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "СтраницыФормы", "ОтображениеСтраниц", ОтображениеСтраницФормы.Нет);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьПрограммаОбучения(Форма)

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"ПрограммаОбучения",
		"Доступность",
		Форма.Объект.ЗапланироватьПрограммуОбучения);

КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеФормы()
	
	УстановитьПривилегированныйРежим(Истина);
	КадровыеРешенияФормы.ФормаДокументаПриПолученииДанных(ЭтотОбъект);
	УстановитьПривилегированныйРежим(Ложь);
	
	УстановитьДоступностьЭлементов();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗависимыеОтМероприятияОбученияРеквизиты(ИдентификаторСтроки)

	ТекущиеДанные = Объект.ПрограммаОбучения.НайтиПоИдентификатору(ИдентификаторСтроки);
	Если Не ЗначениеЗаполнено(ТекущиеДанные.Мероприятие) Тогда
		ТекущиеДанные.Ответственный = ПредопределенноеЗначение("Справочник.ФизическиеЛица.ПустаяСсылка");
		ТекущиеДанные.КоличествоУчебныхЧасов = 0;
		ТекущиеДанные.СуммаРасходов = 0;
		Возврат;
	КонецЕсли;
	
	РеквизитыМероприятия = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТекущиеДанные.Мероприятие, "КоличествоУчебныхЧасов, Ответственный, СпособОпределенияСтоимости, Стоимость, КоличествоСлушателей");
	
	ТекущиеДанные.Ответственный = РеквизитыМероприятия.Ответственный;
	ТекущиеДанные.КоличествоУчебныхЧасов = РеквизитыМероприятия.КоличествоУчебныхЧасов;
	ТекущиеДанные.СуммаРасходов = ОбучениеРазвитиеКлиентСервер.СтоимостьОбученияДляСотрудника(РеквизитыМероприятия);

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИспытательныйСрокНаСервере()
	
	ДанныеПрофиляДолжности = Справочники.ПрофилиДолжностей.ДанныеПрофиляДолжности(Объект.ПрофильДолжности);
	Объект.ИспытательныйСрок = ДанныеПрофиляДолжности.ИспытательныйСрок;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеПоПозицииНаСервере()
	
	ДанныеПозиции = Справочники.ШтатноеРасписание.ДанныеПозицииШтатногоРасписания(Объект.ДолжностьПоШтатномуРасписанию);
	
	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
		Объект.Организация = ДанныеПозиции.Организация;
	КонецЕсли;
	
	Объект.Подразделение = ДанныеПозиции.МестоВСтруктуреПредприятия;
	Объект.Должность = ДанныеПозиции.Должность;
	Объект.ВариантОплатыТруда = Перечисления.ВариантыОплатыТруда.ФОТ;
	
	УстановитьДоступностьРабочегоМеста(ЭтаФорма);
	СписокРабочихМест = СписокРабочихМестПоДаннымПозиции(ДанныеПозиции);
	Элементы.РабочееМесто.СписокВыбора.ЗагрузитьЗначения(СписокРабочихМест.ВыгрузитьЗначения());
	ЗаполнитьРабочееМесто(ЭтаФорма, СписокРабочихМест);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеПоКандидатуНаСервере()
	
	Если Не ЗначениеЗаполнено(Объект.Кандидат)
		Или ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Кандидат, "Состояние") <>
			Перечисления.СостоянияСогласования.Согласовано Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеКандидата = Объект.Кандидат;
	
	СуммаВВалютеПоУмолчанию = ПодборПерсоналаКлиентСервер.СуммаВВалютеПоУмолчанию(
		ДанныеКандидата.ОжидаемыйДоход, ДанныеКандидата.ВалютаДохода);
	Объект.СогласованныйДоход = ПодборПерсоналаКлиентСервер.ОжидаемыйДоходВМесяц(
		СуммаВВалютеПоУмолчанию, ДанныеКандидата.ПериодичностьДохода);
	
	Если ЗначениеЗаполнено(ДанныеКандидата.Вакансия) Тогда
		ДанныеВакансии = Справочники.Вакансии.ДанныеВакансии(ДанныеКандидата.Вакансия);
		Объект.Подразделение = ДанныеВакансии.Подразделение;
		Объект.Должность = ДанныеВакансии.Должность;
		Объект.ПрофильДолжности = ДанныеВакансии.ПрофильДолжности;
		Объект.ИспытательныйСрок = ДанныеВакансии.ИспытательныйСрок;
		Объект.НоваяПозиция = ДанныеВакансии.НоваяПозиция;
		Объект.ДолжностьПоШтатномуРасписанию = ДанныеВакансии.Позиция;
	Иначе
		Объект.Подразделение = ДанныеКандидата.Подразделение;
		Объект.ДолжностьПоШтатномуРасписанию = ДанныеКандидата.Позиция;
		Объект.НоваяПозиция = Ложь;
	КонецЕсли;
	
	УстановитьСклонениеИспытательногоСрока(Объект.ИспытательныйСрок, Элементы.ИспытательныйСрок);
	УстановитьВидимостьПредупреждения(Объект.ИспытательныйСрок, Элементы.ИспытательныйСрокПредупреждение);
	УстановитьВидимостьОплатыТруда();
	УстановитьВидимостьРабочегоМеста();
	УстановитьВидимостьДолжности(ЭтаФорма);
	
	УстановитьДоступностьРабочегоМеста(ЭтаФорма);
	ДанныеПозиции = ДанныеПозицииШтатногоРасписания(Объект.ДолжностьПоШтатномуРасписанию);
	СписокРабочихМест = СписокРабочихМестПоДаннымПозиции(ДанныеПозиции);
	Элементы.РабочееМесто.СписокВыбора.ЗагрузитьЗначения(СписокРабочихМест.ВыгрузитьЗначения());
	ЗаполнитьРабочееМесто(ЭтаФорма, СписокРабочихМест);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьРабочегоМеста()
	
	Если Не ОхранаТруда.ОхранаТрудаИспользуется() Тогда
		Элементы.РабочееМесто.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	Если Объект.НоваяПозиция Тогда
		Элементы.РабочееМесто.Видимость = Ложь;
		РабочееМестоПредыдущееЗначение = Объект.РабочееМесто;
		Объект.РабочееМесто = Неопределено;
		Возврат;
	КонецЕсли;
	
	Элементы.РабочееМесто.Видимость = Истина;
	Если ЗначениеЗаполнено(РабочееМестоПредыдущееЗначение) Тогда
		Объект.РабочееМесто = РабочееМестоПредыдущееЗначение;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьОплатыТруда()
	
	Если Не ПравоДоступа("Просмотр", Метаданные.Документы.РешениеОПриемеНаРаботу.Реквизиты.СогласованныйДоход) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Пользователи.РолиДоступны("ЧтениеНачисленийШтатногоРасписания", , Ложь) Тогда
		Элементы.СогласованныйДоход.Видимость = Истина;
		Элементы.ОплатаТруда.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ДолжностьПоШтатномуРасписанию) Тогда
		Элементы.ОплатаТруда.Видимость = Истина;
		Элементы.СогласованныйДоход.Видимость = Ложь;
		ФОТ = Объект.ДолжностьПоШтатномуРасписанию.ФОТ;
	Иначе
		Элементы.ОплатаТруда.Видимость = Ложь;
		Элементы.СогласованныйДоход.Видимость = Истина;
		ФОТ = 0;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьФункциональныеОпцииФормы()
	
	ПараметрыФО = Новый Структура("Организация", Объект.Организация);
	УстановитьПараметрыФункциональныхОпцийФормы(ПараметрыФО);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИспытательныйСрокНаКлиенте()
	
	Если ЗначениеЗаполнено(ФизическоеЛицо)
		Или ЗначениеЗаполнено(Объект.ИспытательныйСрок)
		Или Не ЗначениеЗаполнено(Объект.ПрофильДолжности) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьИспытательныйСрокНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДанныеПоПозицииНаКлиенте()
	
	Если Не ЗначениеЗаполнено(Объект.ДолжностьПоШтатномуРасписанию) Тогда
		Объект.ВариантОплатыТруда = ПредопределенноеЗначение("Перечисление.ВариантыОплатыТруда.СогласованныйДоход");
		Если Не Объект.НоваяПозиция Тогда
			Объект.Должность = Неопределено;
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	ЗаполнитьДанныеПоПозицииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДанныеПоКандидатуНаКлиенте()
	
	Если Не ЗначениеЗаполнено(Объект.Кандидат) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьДанныеПоКандидатуНаСервере();
	
КонецПроцедуры

// Установить видимость кандидата.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
&НаСервереБезКонтекста
Процедура УстановитьВидимостьКандидата(Форма)
	
	ДоступноЧтениеКандидатов = ПравоДоступа("Чтение", Метаданные.Справочники.Кандидаты);
	
	Элементы = Форма.Элементы;
	
	ЭлементЛичныеДанныеКандидата = Элементы.Найти("ЛичныеДанныеКандидата");
	Если ЭлементЛичныеДанныеКандидата = Неопределено Тогда
		Если ПравоДоступа("Чтение", Метаданные.Справочники.ЛичныеДанныеКандидатов) Тогда
			НовыйЭлемент = Элементы.Добавить("ЛичныеДанныеКандидата", Тип("ПолеФормы"), Элементы.ОсновноеГруппа);
			НовыйЭлемент.ПутьКДанным = "Объект.ЛичныеДанныеКандидата";
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеНадписи;
			НовыйЭлемент.Заголовок = НСтр("ru = 'Принят на работу'");
		Иначе
			НовыйЭлемент = Элементы.Добавить("ЛичныеДанныеКандидата", Тип("ДекорацияФормы"), Элементы.ОсновноеГруппа);
			НовыйЭлемент.Заголовок = НСтр("ru = 'Принят на работу: Данные недоступны'");
		КонецЕсли;
	КонецЕсли;
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Кандидат", "Видимость",
		ДоступноЧтениеКандидатов);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЛичныеДанныеКандидата", "Видимость",
		Не ДоступноЧтениеКандидатов);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьДолжности(Форма)
	
	Элементы = Форма.Элементы;
	Объект = Форма.Объект;
	
	Элементы.Должность.Видимость = Объект.НоваяПозиция;
	Элементы.ДолжностьПоШтатномуРасписанию.Видимость = Не Объект.НоваяПозиция;
	Элементы.ДолжностьПоШтатномуРасписанию.АвтоОтметкаНеЗаполненного = Не Объект.НоваяПозиция;
	Элементы.ДолжностьПоШтатномуРасписанию.ОтметкаНеЗаполненного =
		Не ЗначениеЗаполнено(Объект.ДолжностьПоШтатномуРасписанию) И Не Объект.НоваяПозиция;
	
	Если Объект.НоваяПозиция Тогда
		Форма.ПозицияПредыдущееЗначение = Объект.ДолжностьПоШтатномуРасписанию;
		Объект.ДолжностьПоШтатномуРасписанию = Неопределено;
	ИначеЕсли ЗначениеЗаполнено(Форма.ПозицияПредыдущееЗначение) Тогда
		Объект.ДолжностьПоШтатномуРасписанию = Форма.ПозицияПредыдущееЗначение;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьСклонениеИспытательногоСрока(ИспытательныйСрок, Элемент)
	Элемент.Подсказка = СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(
		НСтр("ru = ';месяц;;месяца;месяцев;'"), ИспытательныйСрок);
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьПредупреждения(ИспытательныйСрок, Предупреждение)
	
	Если ИспытательныйСрок > 3 Тогда
		Предупреждение.Видимость = Истина;
	Иначе
		Предупреждение.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НайтиФизическоеЛицо(ДокументСсылка, Кандидат)
	Возврат Документы.РешениеОПриемеНаРаботу.НайтиФизическоеЛицо(ДокументСсылка, Кандидат);
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьРабочегоМеста(Форма)
	
	Объект = Форма.Объект;
	Элементы = Форма.Элементы;
	
	Если Не ЗначениеЗаполнено(Объект.ДолжностьПоШтатномуРасписанию) Тогда
		Элементы.РабочееМесто.Доступность = Ложь;
		Объект.РабочееМесто = Неопределено;
	Иначе
		Элементы.РабочееМесто.Доступность = Истина;
	КонецЕсли
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДанныеПозицииШтатногоРасписания(Позиция)
	Возврат Справочники.ШтатноеРасписание.ДанныеПозицииШтатногоРасписания(Позиция);
КонецФункции

#Область РабочееМесто

&НаКлиенте
Процедура ОбработатьОповещениеРабочегоМеста(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия <> "Запись_РабочиеМестаОхраныТруда" Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеПозиции = ДанныеПозицииШтатногоРасписания(Объект.ДолжностьПоШтатномуРасписанию);
	СписокРабочихМест = СписокРабочихМестПоДаннымПозиции(ДанныеПозиции);
	Элементы.РабочееМесто.СписокВыбора.ЗагрузитьЗначения(СписокРабочихМест.ВыгрузитьЗначения());
	
	Если СписокРабочихМест.НайтиПоЗначению(Источник) <> Неопределено Тогда
		Объект.РабочееМесто = Источник;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СписокРабочихМестПоДаннымПозиции(ДанныеПозиции);
	
	СписокРабочихМест = ОхранаТруда.РабочиеМестаПоПодразделениюИДолжности(
		ДанныеПозиции.Подразделение,
		ДанныеПозиции.Должность,
		ДанныеПозиции.Организация);
	
	Возврат СписокРабочихМест;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьРабочееМесто(Форма, СписокРабочихМест)
	
	Если Не ЗначениеЗаполнено(СписокРабочихМест) Тогда
		Возврат;
	КонецЕсли;
	
	Если СписокРабочихМест.Количество() = 1 Тогда
		Форма.Объект.РабочееМесто = СписокРабочихМест[0].Значение;
	Иначе
		Форма.Объект.РабочееМесто = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

&НаСервереБезКонтекста
Функция РезультатыМероприятия(Предмет, Мероприятие)
	
	Мероприятия = Новый Массив;
	Мероприятия.Добавить(Мероприятие);
	
	РезультатыМероприятий = АдаптацияУвольнение.РезультатыМероприятий(Предмет, Мероприятия);
	
	Возврат РезультатыМероприятий.Получить(Мероприятие);
	
КонецФункции

&НаСервереБезКонтекста
Процедура УстановитьУсловноеОформление(УсловноеОформление)
	
	УсловноеОформление.Элементы.Очистить();
	
	АдаптацияУвольнениеФормы.РешениеУстановитьУсловноеОформлениеРезультатаВыполнения(УсловноеОформление);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЛичныеДанныеКандидата(Кандидат)
	
	Возврат Справочники.Кандидаты.ДанныеКандидата(Кандидат).ЛичныеДанныеКандидата;
	
КонецФункции

&НаКлиенте
Процедура НаправитьНаМедосмотрЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ДополнительныеПараметры.Записан Тогда
		Записать();
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ФизическоеЛицо) Тогда
		ФизическоеЛицо = НайтиФизическоеЛицо(Объект.Ссылка, Объект.Кандидат);
	КонецЕсли;
	
	СоздатьНаправлениеНаМедосмотр(ФизическоеЛицо);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНаправлениеНаМедосмотр(ФизическоеЛицо)
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", Новый Структура("РешениеОПриемеНаРаботу", Объект.Ссылка));
	
	ОткрытьФорму("Документ.НаправлениеНаМедицинскийОсмотр.Форма.ФормаДокумента", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция СвойствоСтруктуры(Структура, Ключ, ЗначениеПоУмолчанию = Неопределено)
	Возврат ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Структура, Ключ, ЗначениеПоУмолчанию);
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьПредупреждениеОДругомРешении(Форма)

	Форма.Элементы.КандидатРасширеннаяПодсказка.Заголовок = "";
	Если Форма.Объект.Проведен Тогда
		// Нет смысла уже предупреждать.
		Возврат;
	КонецЕсли;
	
	ДругоеРешение = РешениеПоКандидату(Форма.Объект.Кандидат, Форма.Объект.Ссылка);
	Если ЗначениеЗаполнено(ДругоеРешение) Тогда
		МодульСтроковыеФункции = Неопределено;
		#Если Клиент Тогда
			МодульСтроковыеФункции = СтроковыеФункцииКлиент;
		#Иначе
			МодульСтроковыеФункции = СтроковыеФункции;
		#КонецЕсли
		Форма.Элементы.КандидатРасширеннаяПодсказка.Заголовок = 
			МодульСтроковыеФункции.ФорматированнаяСтрока(
				НСтр("ru = 'По этому кандидату уже есть <a href=""%1"">документ решение о приеме на работу</a>'"), 
				ПолучитьНавигационнуюСсылку(ДругоеРешение));
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция РешениеПоКандидату(Кандидат, ИсключаяРешение = Неопределено)
	Возврат Документы.РешениеОПриемеНаРаботу.РешениеПоКандидату(Кандидат, ИсключаяРешение);
КонецФункции

#КонецОбласти
